Repository: nimrod-cohen/future-lms
Catalog: languages/future-lms-*.po
Languages: he_il

source: %s discount
he_il: %s הנחה

source: My courses
he_il: הקורסים שלי

source: Course store
he_il: חנות הקורסים

source: Hey %s
he_il: היי %s

source: Back to site &larr;
he_il: חזרה לאתר &larr;

source: You are not registered to any course
he_il: אינך רשום לאף קורס

source: Course details
he_il: פרטי הקורס

source: Popular
he_il: פופלרי

source: Enter course
he_il: צפייה בקורס

source: Exit to lobby
he_il: צא לאזור התלמידים

source: Toggle videos
he_il: החבא/הצג וידאו

source: Choose lesson
he_il: בחירת שיעור
